FIELD_WIDTH = 100  # Ширина игрового поля
FIELD_HEIGHT = 20  # Высота игрового поля

EMPTY = ' '  # Пустая клетка игрового поля
RACCOON = 'R'  # Енот
OBSTACLE = 'X'  # Препятствия
MINK = 'O'  # Норка
SUPPLY = 's'

DIRECTIONS = {
    "↓": (0, 1),   # Вниз
    "\\": (1, 1),   # Вниз-вправо (замена ↘)
    "→": (1, 0),   # Вправо
    "╱": (1, -1),  # Вверх-вправо (замена ↗)
    "↑": (0, -1),   # Вверх
    "╲": (-1, -1),  # Вверх-влево (замена ↖)
    "←": (-1, 0),   # Влево
    "/": (-1, 1),  # Вниз-влево (замена ↙)
}